УТ_для_edt/src/DataProcessors/CRM_ОбменСAmoCrm/CRM_ОбменСAmoCrm.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_ОбменСAmoCrm</name>
  <comment>Обмен по api https://www.amocrm.ru/developers/content/api/</comment>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Хеш</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Компании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьЗадачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапыПродаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>События</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключениеСуществует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Домен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <type>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользователиСопоставлены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопРеквизитыСозданы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗагрузкиДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерезаписыватьДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖурналСобытий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПомощникПройден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СделкаТест</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьФизЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>refresh_token</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияТокена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СекретныйКлюч</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IDИнтеграции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаДляПеренаправления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПартнерыСопоставление</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяАмо</name>
      <comment>АПК:265 не проверять на орфографию имя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДАмо</name>
      <comment>АПК:265 не проверять на орфографию имя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтактнаяИнформация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипКонтактнойИнформации</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначений</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактныеЛицаСопоставление</name>
    <attributes>
      <name>ИДАмо</name>
      <comment>АПК:265 не проверять на орфографию имя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяАмо</name>
      <comment>АПК:265 не проверять на орфографию имя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипКонтактнойИнформации</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактнаяИнформация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначений</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаФизЛицо</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенийФизЛицо</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизитФизЛицо</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРеквизитаФизЛицо</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СделкиСопоставление</name>
    <attributes>
      <name>ИмяАмо</name>
      <comment>АПК:265 не проверять на орфографию имя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеИнтереса</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДАмо</name>
      <comment>АПК:265 не проверять на орфографию имя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Воронка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выбрано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПользователиСопоставление</name>
    <attributes>
      <name>ИдАмо</name>
      <comment>АПК:265 не проверять на орфографию имя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяАмо</name>
      <comment>АПК:265 не проверять на орфографию имя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлАдресПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выбрано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлектронныйАдресБаза</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЖурналСозданныхОбъектов</name>
    <attributes>
      <name>ОбъектДанных</name>
      <type>
        <types>TaskRef.ЗадачаИсполнителя</types>
        <types>DocumentRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗагрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыВзаимодействийСопоставление</name>
    <attributes>
      <name>ВидыВзаимодействий</name>
      <type>
        <types>CatalogRef.CRM_ВидыВзаимодействий</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяАмо</name>
      <comment>АПК:265 не проверять на орфографию имя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдАмо</name>
      <comment>АПК:265 не проверять на орфографию имя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ_для_edt/src/DataProcessors/CRM_ОбменСAmoCrm/Forms/ФормаЖурнал/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ЖурналСозданныхОбъектов.Загрузить(ПолучитьИзВременногоХранилища(Параметры.ЖурналСозданныхОбъектов));
	Объект.ЖурналСобытий = Параметры.ЖурналСобытий;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЖурналСозданныхОбъектов

&НаКлиенте
Процедура ЖурналСозданныхОбъектовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Элементы.ЖурналСозданныхОбъектов.ТекущиеДанные.ОбъектДанных);
КонецПроцедуры

#КонецОбласти
